// Напишите программу, которая на вход принимает число выдаёт его
// квадрат(число умноженное само на себя)


Console.WriteLine("Write a number: ");

int num = int.Parse(Console.ReadLine()!);

Console.WriteLine(num * num);



